In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName("BasicOpr").getOrCreate()

In [3]:
df1 = spark.read.csv('D://DataSets//emp.csv',inferSchema=True,header=True)

# Schema Information:

In [4]:
df1

DataFrame[empno: int, ename: string, job: string, mgr: int, hiredate: string, sal: int, comm: int, deptno: int]

In [5]:
df1.printSchema()

root
 |-- empno: integer (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: integer (nullable = true)
 |-- hiredate: string (nullable = true)
 |-- sal: integer (nullable = true)
 |-- comm: integer (nullable = true)
 |-- deptno: integer (nullable = true)

In [6]:
df1.columns

['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno']

In [7]:
df1.describe()

DataFrame[summary: string, empno: string, ename: string, job: string, mgr: string, hiredate: string, sal: string, comm: string, deptno: string]

In [8]:
df1.dtypes

[('empno', 'int'),
 ('ename', 'string'),
 ('job', 'string'),
 ('mgr', 'int'),
 ('hiredate', 'string'),
 ('sal', 'int'),
 ('comm', 'int'),
 ('deptno', 'int')]

In [9]:
df1.describe().show(2)

+-------+-----------------+-----+----+-----------------+--------+-----------------+-----+------------------+
|summary|            empno|ename| job|              mgr|hiredate|              sal| comm|            deptno|
+-------+-----------------+-----+----+-----------------+--------+-----------------+-----+------------------+
|  count|               14|   14|  14|               13|      14|               14|    4|                14|
|   mean|7726.571428571428| null|null|7739.307692307692|    null|2073.214285714286|550.0|22.142857142857142|
+-------+-----------------+-----+----+-----------------+--------+-----------------+-----+------------------+
only showing top 2 rows

In [10]:
df1.summary().show()

+-------+------------------+-----+--------+------------------+----------+------------------+-----------------+------------------+
|summary|             empno|ename|     job|               mgr|  hiredate|               sal|             comm|            deptno|
+-------+------------------+-----+--------+------------------+----------+------------------+-----------------+------------------+
|  count|                14|   14|      14|                13|        14|                14|                4|                14|
|   mean| 7726.571428571428| null|    null| 7739.307692307692|      null| 2073.214285714286|            550.0|22.142857142857142|
| stddev|178.29436087795685| null|    null|103.71466033898382|      null|1182.5032235162716|602.7713773341708|  8.01783725737273|
|    min|              7369|ADAMS| ANALYST|              7566|01/23/2002|               800|                0|                10|
|    25%|              7566| null|    null|              7698|      null|              1250|                0|                20|
|    50%|              7782| null|    null|              7698|      null|              1500|              300|                20|
|    75%|              7876| null|    null|              7839|      null|              2975|              500|                30|
|    max|              7934| WARD|SALESMAN|              7902|12/17/2000|              5000|             1400|                30|
+-------+------------------+-----+--------+------------------+----------+------------------+-----------------+------------------+

# Grabbing the data

## Row Objects

In [11]:
df1.first()

Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate='11/17/2001', sal=5000, comm=None, deptno=10)

In [12]:
df1.head(2)

[Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate='11/17/2001', sal=5000, comm=None, deptno=10),
 Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate='05/01/2001', sal=2850, comm=None, deptno=30)]

In [13]:
for line in df1.head(2):
    print(line, '\n')

Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate='11/17/2001', sal=5000, comm=None, deptno=10)

Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate='05/01/2001', sal=2850, comm=None, deptno=30)

In [14]:
df1.head(2)[0]

Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate='11/17/2001', sal=5000, comm=None, deptno=10)

In [15]:
df1.take(2)

[Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate='11/17/2001', sal=5000, comm=None, deptno=10),
 Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate='05/01/2001', sal=2850, comm=None, deptno=30)]

In [16]:
df1.show()

+-----+------+---------+----+----------+----+----+------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
+-----+------+---------+----+----------+----+----+------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|
+-----+------+---------+----+----------+----+----+------+

In [17]:
df1.head(5)[0]['hiredate']

'11/17/2001'

In [18]:
row0=(df1.head(2)[0])

In [19]:
type(row0)

pyspark.sql.types.Row

In [20]:
row0.asDict()

{'empno': 7839,
 'ename': 'KING',
 'job': 'PRESIDENT',
 'mgr': None,
 'hiredate': '11/17/2001',
 'sal': 5000,
 'comm': None,
 'deptno': 10}

In [21]:
dict1=df1.head(2)[0].asDict()
dict1

{'empno': 7839,
 'ename': 'KING',
 'job': 'PRESIDENT',
 'mgr': None,
 'hiredate': '11/17/2001',
 'sal': 5000,
 'comm': None,
 'deptno': 10}

## Column Objects

In [22]:
df1["hiredate"]

Column<'hiredate'>

In [23]:
type(df1["hiredate"])

pyspark.sql.column.Column

In [24]:
df1.select("hiredate")

DataFrame[hiredate: string]

In [25]:
df1.select("sal")

DataFrame[sal: int]

In [26]:
type(df1.select("hiredate"))

pyspark.sql.dataframe.DataFrame

In [27]:
df1.select("hiredate").show()

+----------+
|  hiredate|
+----------+
|11/17/2001|
|05/01/2001|
|06/09/2001|
|04/02/2001|
|09/28/2001|
|02/20/2001|
|09/08/2001|
|12/03/2001|
|02/22/2001|
|02/03/2001|
|12/17/2000|
|04/19/2007|
|05/23/2007|
|01/23/2002|
+----------+

# Creating new columns

In [28]:
from pyspark.sql.functions import *
# Lit() is required while we are creating columns with exact values.
df1 = df1.withColumn('Annualsal', df1.sal*12)
df1.show(2)

+-----+-----+---------+----+----------+----+----+------+---------+
|empno|ename|      job| mgr|  hiredate| sal|comm|deptno|Annualsal|
+-----+-----+---------+----+----------+----+----+------+---------+
| 7839| KING|PRESIDENT|null|11/17/2001|5000|null|    10|    60000|
| 7698|BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    34200|
+-----+-----+---------+----+----------+----+----+------+---------+
only showing top 2 rows

In [29]:
# Adding a new column with a simple copy
df1.withColumn('newDtCol',df1['hiredate']).show(2)

+-----+-----+---------+----+----------+----+----+------+---------+----------+
|empno|ename|      job| mgr|  hiredate| sal|comm|deptno|Annualsal|  newDtCol|
+-----+-----+---------+----+----------+----+----+------+---------+----------+
| 7839| KING|PRESIDENT|null|11/17/2001|5000|null|    10|    60000|11/17/2001|
| 7698|BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    34200|05/01/2001|
+-----+-----+---------+----+----------+----+----+------+---------+----------+
only showing top 2 rows

In [30]:
df1.show()

+-----+------+---------+----+----------+----+----+------+---------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|Annualsal|
+-----+------+---------+----+----------+----+----+------+---------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    60000|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    34200|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    29400|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    35700|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    15000|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    19200|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    18000|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    11400|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    15000|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    36000|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|     9600|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    36000|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    13200|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    15600|
+-----+------+---------+----+----------+----+----+------+---------+

## Column Rename

In [31]:
df1.withColumnRenamed('sal','salary').show(2)

+-----+-----+---------+----+----------+------+----+------+---------+
|empno|ename|      job| mgr|  hiredate|salary|comm|deptno|Annualsal|
+-----+-----+---------+----+----------+------+----+------+---------+
| 7839| KING|PRESIDENT|null|11/17/2001|  5000|null|    10|    60000|
| 7698|BLAKE|  MANAGER|7839|05/01/2001|  2850|null|    30|    34200|
+-----+-----+---------+----+----------+------+----+------+---------+
only showing top 2 rows

# Drop Column

In [32]:
df02 = df1.drop(df1.Annualsal)
df02.show(5)

+-----+------+---------+----+----------+----+----+------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
+-----+------+---------+----+----------+----+----+------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|
+-----+------+---------+----+----------+----+----+------+
only showing top 5 rows

## More complicated operations to create new columns

# change datatype

In [33]:
from pyspark.sql.functions import *
df2 = df1.select(col("hiredate"),col("sal").cast("double"))  # df1.hiredate, df1.sal.cast("double")
df2.show(2)

+----------+------+
|  hiredate|   sal|
+----------+------+
|11/17/2001|5000.0|
|05/01/2001|2850.0|
+----------+------+
only showing top 2 rows

# Define Data Schema

In [34]:
from pyspark.sql.types import StructField, IntegerType, DoubleType, StringType, StructType, DateType

In [35]:
dataSchema = [StructField('empno',IntegerType(),True),
                StructField('ename',StringType(),True),
               StructField('job',StringType(),True),
              StructField('sal',DoubleType(),True)
             ]

In [36]:
finalStruc = StructType(fields=dataSchema)

In [37]:
df3 = spark.read.json('D://DataSets//emp.json', schema=finalStruc)
df3.show()

+-----+------+---------+------+
|empno| ename|      job|   sal|
+-----+------+---------+------+
| 7839|  KING|PRESIDENT|5000.0|
| 7698| BLAKE|  MANAGER|2850.0|
| 7782| CLARK|  MANAGER|2450.0|
| 7566| JONES|  MANAGER|2975.0|
| 7654|MARTIN| SALESMAN|1250.0|
| 7499| ALLEN| SALESMAN|1600.0|
| 7844|TURNER| SALESMAN|1500.0|
| 7900| JAMES|    CLERK| 950.0|
| 7521|  WARD| SALESMAN|1250.0|
| 7902|  FORD|  ANALYST|3000.0|
| 7369| SMITH|    CLERK| 800.0|
| 7788| SCOTT|  ANALYST|3000.0|
| 7876| ADAMS|    CLERK|1100.0|
| 7934|MILLER|    CLERK|1300.0|
+-----+------+---------+------+

# Change Column Type
Availabel types include

BinaryType
BooleanType
ByteType
DoubleType
DateType
FloatType
IntegerType
etc.

In [38]:
df3.select("sal")

DataFrame[sal: double]

In [39]:
# .withColumn return a DataFrame by adding column(s) or replacing the existing column(s) that has the same name.
df4 = df3.withColumn("sal", df3["sal"].cast(DoubleType())).withColumn("ename", df3["ename"].cast(StringType()))
# alternatively other columns datatype can also be changed

In [40]:
df4.select("sal")

DataFrame[sal: double]

In [41]:
df4.select("ename")

DataFrame[ename: string]

In [42]:
df4.show()

+-----+------+---------+------+
|empno| ename|      job|   sal|
+-----+------+---------+------+
| 7839|  KING|PRESIDENT|5000.0|
| 7698| BLAKE|  MANAGER|2850.0|
| 7782| CLARK|  MANAGER|2450.0|
| 7566| JONES|  MANAGER|2975.0|
| 7654|MARTIN| SALESMAN|1250.0|
| 7499| ALLEN| SALESMAN|1600.0|
| 7844|TURNER| SALESMAN|1500.0|
| 7900| JAMES|    CLERK| 950.0|
| 7521|  WARD| SALESMAN|1250.0|
| 7902|  FORD|  ANALYST|3000.0|
| 7369| SMITH|    CLERK| 800.0|
| 7788| SCOTT|  ANALYST|3000.0|
| 7876| ADAMS|    CLERK|1100.0|
| 7934|MILLER|    CLERK|1300.0|
+-----+------+---------+------+

# Joining Data Frames
'inner', 'outer', 'full', 'fullouter', 'full_outer',
'leftouter', 'left', 'left_outer', 'rightouter', 'right', 'right_outer',
'leftsemi', 'left_semi', 'leftanti', 'left_anti', 'cross'

In [43]:
dept = spark.read.csv('D://DataSets//dept.csv',inferSchema=True,header=True)

In [44]:
emp = spark.read.csv('D://DataSets//emp.csv',inferSchema=True,header=True)

In [45]:
res04=dept.join(emp,dept.deptno==emp.deptno,'left')
res04.show()

+------+----------+--------+-----+------+---------+----+----------+----+----+------+
|deptno|     dname|     loc|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
+------+----------+--------+-----+------+---------+----+----------+----+----+------+
|    10|ACCOUNTING|NEW YORK| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|
|    10|ACCOUNTING|NEW YORK| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|
|    10|ACCOUNTING|NEW YORK| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|
|    20|  RESEARCH|  DALLAS| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|
|    20|  RESEARCH|  DALLAS| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|
|    20|  RESEARCH|  DALLAS| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|
|    20|  RESEARCH|  DALLAS| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|
|    20|  RESEARCH|  DALLAS| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|
|    30|     SALES| CHICAGO| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|
|    30|     SALES| CHICAGO| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|
|    30|     SALES| CHICAGO| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|
|    30|     SALES| CHICAGO| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|
|    30|     SALES| CHICAGO| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|
|    30|     SALES| CHICAGO| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|
|    40|OPERATIONS|  BOSTON| null|  null|     null|null|      null|null|null|  null|
+------+----------+--------+-----+------+---------+----+----------+----+----+------+

In [46]:
res04=emp.crossJoin(dept)
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    20|  RESEARCH|  DALLAS|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    30|     SALES| CHICAGO|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    40|OPERATIONS|  BOSTON|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    10|ACCOUNTING|NEW YORK|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    20|  RESEARCH|  DALLAS|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    40|OPERATIONS|  BOSTON|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    20|  RESEARCH|  DALLAS|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    30|     SALES| CHICAGO|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    40|OPERATIONS|  BOSTON|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    10|ACCOUNTING|NEW YORK|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    30|     SALES| CHICAGO|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    40|OPERATIONS|  BOSTON|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    10|ACCOUNTING|NEW YORK|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    20|  RESEARCH|  DALLAS|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    40|OPERATIONS|  BOSTON|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
only showing top 20 rows

In [47]:
#referering df02 will result in sowing its columns first
res04=emp.join(dept,emp.deptno==dept.deptno,'right')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| null|  null|     null|null|      null|null|null|  null|    40|OPERATIONS|  BOSTON|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

In [48]:
res04=emp.join(dept,emp.deptno==dept.deptno,'inner')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

In [49]:
res04=emp.join(dept,emp.deptno==dept.deptno,'outer')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| null|  null|     null|null|      null|null|null|  null|    40|OPERATIONS|  BOSTON|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

In [50]:
res04=emp.join(dept,emp.deptno==dept.deptno,'full')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| null|  null|     null|null|      null|null|null|  null|    40|OPERATIONS|  BOSTON|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

In [51]:
#referering df02 will result in sowing its columns first
res04=emp.join(dept,emp.deptno==dept.deptno,'right')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| null|  null|     null|null|      null|null|null|  null|    40|OPERATIONS|  BOSTON|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

In [52]:
res04=emp.join(dept,emp.deptno==dept.deptno,'left_anti')
res04.show()

+-----+-----+---+---+--------+---+----+------+
|empno|ename|job|mgr|hiredate|sal|comm|deptno|
+-----+-----+---+---+--------+---+----+------+
+-----+-----+---+---+--------+---+----+------+

In [53]:
res04=emp.join(dept,emp.deptno==dept.deptno,'left_semi')
res04.show()

+-----+------+---------+----+----------+----+----+------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
+-----+------+---------+----+----------+----+----+------+
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|
+-----+------+---------+----+----------+----+----+------+

In [54]:
res04=emp.join(dept,emp.deptno==dept.deptno,'rightouter')
res04.show()

+-----+------+---------+----+----------+----+----+------+------+----------+--------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|deptno|     dname|     loc|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+
| 7934|MILLER|    CLERK|7782|01/23/2002|1300|null|    10|    10|ACCOUNTING|NEW YORK|
| 7782| CLARK|  MANAGER|7839|06/09/2001|2450|null|    10|    10|ACCOUNTING|NEW YORK|
| 7839|  KING|PRESIDENT|null|11/17/2001|5000|null|    10|    10|ACCOUNTING|NEW YORK|
| 7876| ADAMS|    CLERK|7788|05/23/2007|1100|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|04/19/2007|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7369| SMITH|    CLERK|7902|12/17/2000| 800|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|02/03/2001|3000|null|    20|    20|  RESEARCH|  DALLAS|
| 7566| JONES|  MANAGER|7839|04/02/2001|2975|null|    20|    20|  RESEARCH|  DALLAS|
| 7521|  WARD| SALESMAN|7698|02/22/2001|1250| 500|    30|    30|     SALES| CHICAGO|
| 7900| JAMES|    CLERK|7698|12/03/2001| 950|null|    30|    30|     SALES| CHICAGO|
| 7844|TURNER| SALESMAN|7698|09/08/2001|1500|   0|    30|    30|     SALES| CHICAGO|
| 7499| ALLEN| SALESMAN|7698|02/20/2001|1600| 300|    30|    30|     SALES| CHICAGO|
| 7654|MARTIN| SALESMAN|7698|09/28/2001|1250|1400|    30|    30|     SALES| CHICAGO|
| 7698| BLAKE|  MANAGER|7839|05/01/2001|2850|null|    30|    30|     SALES| CHICAGO|
| null|  null|     null|null|      null|null|null|  null|    40|OPERATIONS|  BOSTON|
+-----+------+---------+----+----------+----+----+------+------+----------+--------+

# SET operations on DF

In [55]:
df03=emp.filter("deptno==10").select(['job']).distinct() # SELECT DISTINCT job FROM emp WHERE deptno=10
df03.show()

+---------+
|      job|
+---------+
|    CLERK|
|  MANAGER|
|PRESIDENT|
+---------+

In [56]:
df04=emp.filter("deptno==20").select(['job']).distinct()
df04.show()

+-------+
|    job|
+-------+
|ANALYST|
|  CLERK|
|MANAGER|
+-------+

In [57]:
df03.unionAll(df04).show()

+---------+
|      job|
+---------+
|    CLERK|
|  MANAGER|
|PRESIDENT|
|  ANALYST|
|    CLERK|
|  MANAGER|
+---------+

In [58]:
#union returns same as unionAll ie. duplicate records
df03.union(df04).show()

+---------+
|      job|
+---------+
|    CLERK|
|  MANAGER|
|PRESIDENT|
|  ANALYST|
|    CLERK|
|  MANAGER|
+---------+

In [59]:
# to remove duplicationfrom union
df03.union(df04).distinct().show()

+---------+
|      job|
+---------+
|  ANALYST|
|    CLERK|
|  MANAGER|
|PRESIDENT|
+---------+

In [60]:
df03.intersect(df04).show()

+-------+
|    job|
+-------+
|  CLERK|
|MANAGER|
+-------+

In [61]:
df03.subtract(df04).show()

+---------+
|      job|
+---------+
|PRESIDENT|
+---------+

In [62]:
df04.subtract(df03).show()

+-------+
|    job|
+-------+
|ANALYST|
+-------+

In [67]:
spark.stop()